import os
import re

hostIP = "dfggdf127.0.0.1sdfsd sdf192.168.1.1 dfg df"

# Парсим одного IPv4
pat = re.compile(r"\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3}")
test = pat.search(hostIP)
print("первый IP >>", test.group())

# Парсим нескольких IPv4
pat = re.compile(r"\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3}")
test = pat.findall(hostIP)
print("Все IP >>", test)

# Парсим нескольких IPv6
ip6 = "afas2001:0DB8:AA10:0001:0000:0000:0000:00FBadf dfsg 435 dgdf127.0.0.1sd sd192.168.1.1 dg df"
pat = re.compile(
    r"(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))"
)
test = pat.search(ip6)
print("Все IPv6 >>", test.group())

os.system("pause" if os.name == "nt" else
          """bash -c 'read -s -n 1 -p "Press any key to continue...\n"'""")
