# Cоздадим файл например myapp.py
print("Hellow World!")

# Сохраняем и запускаем через консоль находясь в папке с нашим скриптом.
python myapp.py

# На экране должно отобразиться "Hello World!".
# Поздравляю с написанием первой программы на Python


# Переменная задается выражением имя = значение
i = 10
txt = "Привет мир!"

# При назначении переменная имеет тип советующий значению. Так i является числом (int), а txt строкой.

# Типы данных python:
# bool - логическое значение True или False
# str - строки представляют набор символов в кодировке Unicode “Hello world”
# int - представляет целое число 1, 2, 100 и тд.
# list - список [1, “два”, 3.1]
# tuple - кортеж (“Первый”, “Второй”, “Третий”)
# dict - словарь, каждый элемент имеет ключ и значение {1: “Первый”, 2: “Второй”}
# float - представляет число с плавающей точкой 3.14
# complex - комплексные числа
# bytes - последовательность чисел в диапазоне 0-255
# bytes - array массив байтов, аналогичен bytes с тем отличием, что может изменяться
# set - неупорядоченная коллекция уникальных объектов
# frozen set - то же самое, что и set, только не может изменяться (immutable)

# Логические выражения
# == - Сравнение
# != - НЕ равно
# < - Меньше
# > - Больше
# <= - Меньше либо равно
# >= - Больше либо равно
